/*********************************************************************************************************************
 * COPYRIGHT NOTICE
 * Copyright (c) 2020,逐飞科技
 * All rights reserved.
 * 技术讨论QQ群：一群：179029047(已满)  二群：244861897(已满)  三群：824575535
 *
 * 以下所有内容版权均属逐飞科技所有，未经允许不得用于商业用途，
 * 欢迎各位使用并传播本程序，修改内容时必须保留逐飞科技的版权声明。
 *
 * @file       		main
 * @company	   		成都逐飞科技有限公司
 * @author     		逐飞科技(QQ790875685)
 * @version    		查看doc内version文件 版本说明
 * @Software 		MDK5.27
 * @Target core		STC8H8K64S4
 * @Taobao   		https://seekfree.taobao.com/
 * @date       		2022-3-8
 ********************************************************************************************************************/

#include "headfile.h"

// *************************** 例程说明 ***************************
// 
// 测试需要准备逐飞科技 MM32F3277 核心板一块
// 
// 调试下载需要准备逐飞科技 CMSIS-DAP 调试下载器 或 ARM 调试下载器 一个
// 
// 本例程初始化了 主板上的无线转串口接口
// 
// 烧录本例程后 请断电接线
// 需要安装无线转串口模块
// 确认连接无误 上电 请务必使用电池供电 并确保电池电量充足
// 电脑上连接无线转串口的PC端 打开串口助手 可见数据输出
// 
// 打开新的工程或者工程移动了位置务必执行以下操作
// 第一步 关闭上面所有打开的文件
// 第二步 project->clean  等待下方进度条走完
// 
// *************************** 例程硬件连接说明 ***************************
//      模块管脚            单片机管脚
//      RX                  查看SEEKFREE_WIRELESS_CH573.h文件中WIRELESS_CH573_UART_RX宏定义的引脚 默认 P03
//      TX                  查看SEEKFREE_WIRELESS_CH573.h文件中WIRELESS_CH573_UART_TX宏定义的引脚 默认 P02
//      RTS                 查看SEEKFREE_WIRELESS_CH573.h文件中RTS_PIN宏定义的引脚 默认 P07
//      GND                 电源地
//      VCC                 5V电源


// *************************** 例程测试说明 ***************************
//1. 使用该模块前先使用上位机进行配置
//2. 使用现象：
//单片机通过模块持续发送数据,LED会常亮，其他邻居设备（邻居设备请查看说明书定义）会收到数据
//可以将邻居设备连接到电脑查看接收的数据
//如果邻居设备是排针端，需要使用TTL连接到电脑
//如果邻居设备是USB端，可以直接插到电脑上

//如果发现现象与说明严重不符 请参照本文件最下方 例程常见问题说明 进行排查

// **************************** 代码区域 ****************************
uint8 send_test_dat[] = "wireless ch573 demo\r\n";

int main(void)
{
	DisableGlobalIRQ();							//关闭总中断
	board_init();								//初始化内部寄存器
	P52 = 1;
    wireless_ch573_init();
	P52 = 0;
	
	EnableGlobalIRQ();							//开启总中断
    while(1)
	{
        wireless_ch573_send_buff(send_test_dat, sizeof(send_test_dat)); //初始化正常 输出测试信息
        delay_ms(1000); 
	}
}


// **************************** 代码区域 ****************************

// *************************** 例程常见问题说明 ***************************
//问题1：其他无线CH573模块设备没有收到数据
//使用例程后查看单片机LED有没有快速闪烁，
//LED常亮查看连接单片机的CH573有没有闪烁蓝灯
//CH573蓝灯正常闪烁，检查设备之间有没有配置成功，查看CH573说明书
